/**
 * 你好！我叫王锋，现在是软件工程专业一名大三的学生。
 * 自从大一以来接触web前端以来，我就定下了从事前端工作的目标，并且一直有技术博客的积累。
 * 在注重基础的学习下，对技术的学习比较渴望，比如当我听说typescript的优势可以爬虫之后，我了解和基础学习了一下
 * typescript，并尝试着用typescript做了一个简单的爬虫，前段时间，我发现auto.js可以写安卓
 * 端的脚本后我立即尝试了一下，写了一个微信小程序我在校园自动打卡的脚本。并且
 * 我在大二暑假，跟随老师的团队做过一个有关可视化二次开发的项目，在此项目中我主要负责一些组件的修改，
 * 完善等功能，项目主要用到技术栈是react和antd，除了用过react  我在vue上面花的时间也比较多
 *
 * 我除了学习前端的一些技术外，我还了解学习过其他方面的技术，比如java是学校所设的学科，所以我了解学习
 * 过javaweb，并且听说了springboot的优势后，尝试写过一个简单增删改查的商品管理系统。后来了解到docker
 * 上线运维的优势后，基础学习了docker，用docker将线其运维上了
 *
 *
 *
 * 而是目的这句话
 * 谢谢  以上是我的自我介绍
 *
 *
 *
 *
 *
 *
 * redash可视化开发项目准备
 * 由于
 *
 * 1，菜单栏的切换，具有最高权限的人有切换功能
 * 2，左边的菜单栏本来只有一层结构的，后面需要更改为几层结构的菜单，也就是父菜单里面
 * 还有子菜单。还有把一个table也渲染成树状的。，
 * 3，不同权限的人分组，filter
 * 4.在另一个页面的switch  控制仪表盘页面widget的header和footer的显示.localstorage.
 * post请求
 *
 *
 * react-hook准备
 * setState:改变状态
 *
 *
 *
 *
 *
 *
 *
 *


    我非常想问的一个问题就是：毕竟我还没有工作过
    就是你们现在每天的工作 会不会经常都是那种特别兴奋的状态
    或者说你除开经济上的原因，其他工作的动力是什么
    或者换一种说法吧，就是你们做的产品  会不会经常感受到自己创造了那么一小点点价值
    你认为你现在的工作 是目的 还是手段


    就是想问一下，面试的这个岗位 ，具体会有哪些工作，会有什么发展



 *
 */

